Repository: OctoPrint/OctoPrint-MfaTotp
Catalog: octoprint_mfa_totp/translations/*/LC_MESSAGES/messages.po
Languages: de

source: The entered token has already been used, please wait for a new one
de: Der eingegebene Token wurde bereits verwendet, bitte warte auf einen neuen

source: Active
de: Aktiv

source: Not active
de: Nicht aktiv

source: Token could not be verified.
de: Der Token konnte nicht verifiziert werden.

source: Enrollment for TOTP based two-factor authentication
de: Aktivierung der TOTP-basierten Zwei-Faktor-Authentifizierung

source: Scan the QR code with your authenticator app or manually add the provided time based key, then submit a generated token to activate TOTP two-factor authentication.
de: Scanne den QR-Code mit deiner Authenticator-App oder füge den bereitgestellten zeitbasierten Schlüssel manuell hinzu. Gib dann einen generierten Token ein, um die TOTP-Zwei-Faktor-Authentifizierung zu aktivieren.

source: Key
de: Schlüssel

source: Key to manually add to your authenticator app. Make sure to choose "time based" as key type.
de: Schlüssel, der manuell zu deiner Authenticator-App hinzugefügt werden soll. Stelle sicher, dass du "zeitbasiert" als Schlüsseltyp auswählst.

source: Close
de: Schließen

source: Enroll
de: Anmelden

source: Please verify TOTP deactivation
de: Bitte bestätige die Deaktivierung von TOTP

source: Please submit a generated token from your authenticator app to verify deactivating your two-factor TOTP enrollment.
de: Bitte gib einen generierten Token aus deiner Authenticator-App ein, um die Deaktivierung deiner Zwei-Faktor-TOTP-Anmeldung zu bestätigen.

source: Abort
de: Abbrechen

source: Confirm
de: Bestätigen

source: Please enter the code generated by your authenticator app:
de: Bitte gib den Code ein, der von deiner Authenticator-App generiert wurde:

source: Submit
de: Absenden

source: If you want to activate two-factor authentication via TOTP for your account, click the button below. You will be asked to scan or manually enter your secret key into your authenticator application, and then to provide a generated code for verification.
de: Wenn du die Zwei-Faktor-Authentifizierung über TOTP für dein Konto aktivieren möchtest, klicke auf den Button unten. Du wirst aufgefordert, deinen geheimen Schlüssel in deine Authenticator-App zu scannen oder manuell einzugeben und dann einen generierten Code zur Verifizierung bereitzustellen.

source: If you want to disable two-factor authentication via TOTP, click the button below. You will be required to enter a current code to confirm the deactivation.
de: Wenn du die Zwei-Faktor-Authentifizierung über TOTP deaktivieren möchtest, klicke auf den Button unten. Du wirst aufgefordert, einen aktuellen Code einzugeben, um die Deaktivierung zu bestätigen.
